2024-08-07-my-exam-organization-experience.html
<!doctype html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <meta
      name="description"
      content="This note record my experience of organizing exams."
    />
    <link
      rel="alternate"
      type="application/rss+xml"
      href="https://chenyo-17.github.io/org-static-blog/rss.xml"
      title="RSS feed for https://chenyo-17.github.io/org-static-blog"
    />
    <title>My Exam Organization Experience</title>
    <meta name="author" content="chenyo" />
    <meta name="referrer" content="no-referrer" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <link rel="stylesheet" href="static/style.css" type="text/css" />
  </head>
  <body>
    <div id="preamble" class="status">
      <header>
        <h1><a href="/">Chenyo's org-static-blog</a></h1>
        <nav>
          <a href="/">Home</a>
          <a href="archive.html">Archive</a>
          <a href="tags.html">Tags</a>
          <div id="search-container">
            <input
              type="text"
              id="search-input"
              placeholder="Search anywhere..."
            />
          </div>
        </nav>
      </header>
    </div>
    <div id="content">
      <div class="post-date">07 Aug 2024</div>
      <h1 class="post-title">
        <a
          href="https://chenyo-17.github.io/org-static-blog/2024-08-07-my-exam-organization-experience.html"
          >My Exam Organization Experience</a
        >
      </h1>
      <nav id="table-of-contents" role="doc-toc">
        <h2>Table of Contents</h2>
        <div id="text-table-of-contents" role="doc-toc">
          <ul>
            <li><a href="#org6dddcf9">1. What is it about?</a></li>
            <li><a href="#org5dfaea5">2. My first exam</a></li>
            <li><a href="#orgb544b1f">3. My second exam</a></li>
            <li><a href="#orgc07fe87">4. My third exam</a></li>
            <li><a href="#org0be130b">5. My fourth exam</a></li>
            <li><a href="#orgab1db59">6. My feeling</a></li>
          </ul>
        </div>
      </nav>
      <p>
        This post was co-authored with the assistance of Cursor and Claude AI.
      </p>
      <div id="outline-container-org6dddcf9" class="outline-2">
        <h2 id="org6dddcf9">
          <span class="section-number-2">1.</span> What is it about?
        </h2>
        <div class="outline-text-2" id="text-1">
          <p>
            Over the past years, I&rsquo;ve been involved in organizing and
            monitoring four exams. Yesterday marked my fourth and likely final
            exam monitoring session for the foreseeable future. Now seems like
            an opportune moment to reflect on my exam organization journey.
          </p>
        </div>
      </div>
      <div id="outline-container-org5dfaea5" class="outline-2">
        <h2 id="org5dfaea5">
          <span class="section-number-2">2.</span> My first exam
        </h2>
        <div class="outline-text-2" id="text-2">
          <p>
            My first exam experience was relatively straightforward. As I was
            unfamiliar with the exam content, my primary responsibility was
            taking students to the restrooms. I recall accompanying nearly 10
            students during the session. For the remainder of the time, I sat at
            the back of the room, occupying myself with some drawing.
          </p>
        </div>
      </div>
      <div id="outline-container-orgb544b1f" class="outline-2">
        <h2 id="orgb544b1f">
          <span class="section-number-2">3.</span> My second exam
        </h2>
        <div class="outline-text-2" id="text-3">
          <p>
            This exam was identical to the first, but I was tasked with
            designing a significant portion of the questions. Initially,
            formulating questions seemed straightforward, but I later realized
            my inability to create effective ones. My first draft incorporated
            connections between various questions. During the review process, I
            was advised to maximize information density in questions, as
            stressed students prefer concise text. Additional challenges emerged
            when I began grading the exams. For example, open-ended questions
            consistently yielded unexpected answers, requiring me to modify the
            grading scheme while maintaining consistency with previous
            assessments.
          </p>

          <p>
            The exam monitoring this time was more demanding as I began
            responding to student inquiries. My limited knowledge of the entire
            exam often required me to seek assistance from colleagues, and
            occasionally I struggled to comprehend the questions.
          </p>

          <p>
            Grading the exam proved to be the most challenging aspect of the
            process. Evaluating over 100 exams, deciphering handwriting,
            determining fair point allocations, and recording scores was an
            incredibly tedious task. Unlike traditional mathematics exams that
            focus primarily on calculations, our exam encouraged creative
            thinking. Each answer contained implicit assumptions about the
            question, requiring careful interpretation to avoid excessive point
            deductions. The process was extremely time-consuming and offered
            minimal personal benefit or satisfaction.
          </p>
        </div>
      </div>
      <div id="outline-container-orgc07fe87" class="outline-2">
        <h2 id="orgc07fe87">
          <span class="section-number-2">4.</span> My third exam
        </h2>
        <div class="outline-text-2" id="text-4">
          <p>
            This was a different exam, where I again designed one part and
            monitored its administration. Fortunately, due to its advanced
            nature, few students registered for this exam. This time, I had the
            privilege of collaborating with exceptional colleagues. Despite
            these advantages, the design process still demanded considerable
            effort on my part.
          </p>

          <p>
            A unique aspect of this exam was that I also developed the course
            material, as it was a newly introduced subject. The topic proved
            challenging, and the exercises were demanding. Students expressed
            concerns about the complexity of the material. Consequently, we
            faced the task of devising ways to simplify the exam questions
            without compromising their effectiveness.
          </p>
        </div>
      </div>
      <div id="outline-container-org0be130b" class="outline-2">
        <h2 id="org0be130b">
          <span class="section-number-2">5.</span> My fourth exam
        </h2>
        <div class="outline-text-2" id="text-5">
          <p>
            Now comes the most recent exam, where I took on the role of a
            coordinator. This position entailed not only designing my portion of
            the tasks but also finding colleagues to design other tasks,
            managing the timeline, reviewing drafts, printing exams,
            coordinating exam monitoring, and overseeing the grading process.
            Fortunately, I had the support of proactive and helpful colleagues,
            which allowed everything to proceed smoothly.
          </p>

          <p>
            The monitoring process proved particularly demanding this time. As I
            was now familiar with the entire exam, I was responsible for reading
            instructions, making announcements, and answering as many questions
            as possible. I had to arrive at the exam rooms by 8 AM, forgoing
            breakfast, and remained standing and focused until noon. In
            retrospect, I may have been overly diligent due to inexperience and
            could have perhaps allowed myself to relax more. However, I&rsquo;ll
            never know for certain, as this marks the conclusion of my exam
            organization duties.
          </p>

          <p>
            Well, not quite the end, as I still need to complete the grading and
            submit the results.
          </p>
        </div>
      </div>
      <div id="outline-container-orgab1db59" class="outline-2">
        <h2 id="orgab1db59">
          <span class="section-number-2">6.</span> My feeling
        </h2>
        <div class="outline-text-2" id="text-6">
          <p>
            After four instances of exam organization experience, I must admit
            that I do not recommend it. This opinion is, of course, highly
            personal, as I am not particularly inclined towards teaching. From
            my perspective, it is a job that demands significant effort while
            offering minimal returns. I can confidently say that I invest more
            time in the exam process than any individual student taking it.
          </p>

          <p>
            The process of designing and grading exams presents a complex
            optimization challenge. There&rsquo;s an inverse relationship
            between the time spent on design and the time required for grading.
            The less effort put into crafting the exam, the more time-consuming
            the grading process becomes. Moreover, it&rsquo;s disheartening to
            spend two full days meticulously designing and reviewing a question,
            only to have it attempted by a mere handful of students.
          </p>
        </div>
      </div>
      <div class="taglist">
        <a href="https://chenyo-17.github.io/org-static-blog/tags.html">Tags</a
        >:
        <a href="https://chenyo-17.github.io/org-static-blog/tag-personal.html"
          >personal</a
        >
        <a href="https://chenyo-17.github.io/org-static-blog/tag-teach.html"
          >teach</a
        >
      </div>
    </div>
    <div id="postamble" class="status">
      <div id="search-results"></div>
      <footer>
        <p>© 2024 chenyo. Some rights reserved.</p>
      </footer>
    </div>
  </body>
</html>
